Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: An ExecutorService manages queuing and scheduling of tasks, and allows controlled shutdown.
zh_cn: ExecutorService 管理任务的排队和安排，并允许受控制的关闭。

source: An HttpCookie object represents an http cookie, which carries state information between server and user agent.
zh_cn: HttpCookie 对象表示一个 http cookie，该 cookie 带有服务器和用户代理之间的状态信息。

source: An IllegalAccessException is thrown when an application tries to reflectively create an instance (other than an array), set or get a field, or invoke a method, but the currently executing method does not have access to the definition of the specified class, field, method or constructor.
zh_cn: 当应用程序试图反射性地创建一个实例（而不是数组）、设置或获取一个字段，或者调用一个方法，但当前正在执行的方法无法访问指定类、字段、方法或构造方法的定义时，抛出 IllegalAccessException。

source: An InputStreamReader is a bridge from byte streams to character streams: It reads bytes and decodes them into characters using a specified charset.
zh_cn: InputStreamReader 是字节流通向字符流的桥梁：它使用指定的 charset 读取字节并将其解码为字符。

source: An Iterator specialized for double values.
zh_cn: 一个专用于 double 值的迭代器。

source: An Iterator specialized for int values.
zh_cn: 一个专用于 int 值的迭代器。

source: An Iterator specialized for long values.
zh_cn: 一个专用于 long 值的迭代器。

source: An ObjectInputStream deserializes primitive data and objects previously written using an ObjectOutputStream.
zh_cn: ObjectInputStream 对以前使用 ObjectOutputStream 写入的基本数据和对象进行反序列化。

source: An ObjectOutputStream writes primitive data types and graphs of Java objects to an OutputStream.
zh_cn: ObjectOutputStream 将 Java 对象的基本数据类型和图形写入 OutputStream。

source: An OutputStreamWriter is a bridge from character streams to byte streams: Characters written to it are encoded into bytes using a specified charset.
zh_cn: OutputStreamWriter 是字符流通向字节流的桥梁：可使用指定的 charset 将要写入流中的字符编码成字节。

source: An abstract Spliterator.OfDouble that implements trySplit to permit limited parallelism.
zh_cn: 一个抽象 Spliterator.OfDouble 实现 trySplit 以允许有限的并行性。

source: An abstract Spliterator.OfInt that implements trySplit to permit limited parallelism.
zh_cn: 一个抽象 Spliterator.OfInt 实现 trySplit 以允许有限的并行性。

source: An abstract Spliterator.OfLong that implements trySplit to permit limited parallelism.
zh_cn: 一个抽象 Spliterator.OfLong 实现 trySplit 以允许有限的并行性。

source: An abstract Spliterator that implements trySplit to permit limited parallelism.
zh_cn: 一个抽象 Spliterator 实现 trySplit 以允许有限的并行性。

source: An abstract representation of file and directory pathnames.
zh_cn: 文件和目录路径名的抽象表示形式。

source: An abstract wrapper class for an EventListener class which associates a set of additional parameters with the listener.
zh_cn: 将一组附加参数与侦听器关联的 EventListener 类的抽象包装器类。

source: An additional danger of this method is that it may be used to generate exceptions that the target thread is unprepared to handle (including checked exceptions that the thread could not possibly throw, were it not for this method).
zh_cn: 该方法的附加危险是它可用于生成目标线程未准备处理的异常（包括若没有该方法该线程不太可能抛出的已检查的异常）。

source: An application can ask if the package is compatible with a particular version, see the isCompatibleWith method for details.
zh_cn: 应用程序可以询问包是否与特定版本兼容，有关详细信息，请参阅 isCompatibleWith 方法。

source: An application cannot create its own instance of this class.
zh_cn: 应用程序不能创建自己的 Runtime 类实例。

source: An array of object references in which elements may be updated atomically.
zh_cn: 可以用原子方式更新其元素的对象引用数组。

source: An element in a stack trace, as returned by getStackTrace().
zh_cn: 堆栈跟踪中的元素，它由 getStackTrace() 返回。

source: An enum is a kind of class and an annotation is a kind of interface.
zh_cn: 枚举是一种类，注释是一种接口。

source: An enum type should override this method when a more "programmer-friendly" string form exists.
zh_cn: 当存在更加“程序员友好的”字符串形式时，应该使用枚举类型重写此方法。

source: An enumeration of cryptographic primitives.
zh_cn: 密码原语的枚举。

source: An immutable arbitrary-precision signed decimal.
zh_cn: 不可变的、任意精度的有符号十进制数。

source: An immutable arbitrary-precision signed integer.
zh_cn: 不可变的、任意精度的有符号整数。

source: An implementation of ReadWriteLock supporting similar semantics to ReentrantLock.
zh_cn: 支持与 ReentrantLock 类似语义的 ReadWriteLock 实现。

source: An index ranges from zero to length() - 1.
zh_cn: 索引范围是从零到 length() - 1。

source: An informative annotation type used to indicate that an interface type declaration is intended to be a functional interface as defined by the Java Language Specification.
zh_cn: 一种信息性注解类型，用于指示接口类型声明是由 Java 语言规范定义的 functional interface (函数式接口)。

source: An instance of ThreadDeath is thrown in the victim thread when the (deprecated) stop() method is invoked.
zh_cn: 实例 ThreadDeath 在受害线程(废弃的) stop() 方法调用时抛出。

source: An instance of HashMap has two parameters that affect its performance: initial capacity and load factor.
zh_cn: HashMap 的实例有两个参数影响其性能：初始容量 和加载因子。

source: An instance of one of these subclasses encapsulates a single reference to a particular object, called the referent.
zh_cn: 其中一个子类的实例封装了对特定对象的引用，该对象名为 指示对象。

source: An instance of the class can then be allocated, passed as an argument when creating Thread, and started.
zh_cn: 然后可以分配该类的实例，在创建 Thread 时作为一个参数来传递并启动。

source: An instance of the subclass can then be allocated and started.
zh_cn: 接下来可以分配并启动该子类的实例。

source: An instance of this class is used to generate a stream of pseudorandom numbers.
zh_cn: 此类的实例用于生成伪随机数流。

source: An int buffer.
zh_cn: int 缓冲区。

source: An interface method invocation on a proxy instance will be encoded and dispatched to the invocation handler's invoke method as described in the documentation for that method.
zh_cn: 代理实例上的接口方法调用将按照该方法的文档描述进行编码，并被指派到调用处理程序的 Invoke 方法。

source: An interpreter for printf-style format strings.
zh_cn: printf 风格的格式字符串的解释程序。

source: An invocation of the hashCode, equals, or toString methods declared in java.lang.Object on a proxy instance will be encoded and dispatched to the invocation handler's invoke method in the same manner as interface method invocations are encoded and dispatched, as described above.
zh_cn: 在代理实例上的 java.lang.Object 中声明的 hashCode、equals 或 toString 方法的调用将按照与编码和指派接口方法调用相同的方式进行编码，并被指派到调用处理程序的 invoke 方法，如上所述。

source: An invocation of this method behaves in exactly the same way as the invocation
zh_cn: 此方法的调用行为有完全相同的方式，与调用

source: An invocation of this method of the form
zh_cn: 调用该方法的形式为：

source: An iterator for lists that allows the programmer to traverse the list in either direction, modify the list during iteration, and obtain the iterator's current position in the list.
zh_cn: 系列表迭代器，允许程序员按任一方向遍历列表、迭代期间修改列表，并获得迭代器在列表中的当前位置。

source: An iterator over a collection.
zh_cn: 对 collection 进行迭代的迭代器。

source: An object for traversing and partitioning elements of a source.
zh_cn: 用于遍历和划分源元素的对象。

source: An object is phantom reachable if it is neither strongly, softly, nor weakly reachable, it has been finalized, and some phantom reference refers to it.
zh_cn: 如果一个对象既不是强可到达对象，也不是软可到达对象或弱可到达对象，它已经终止，并且某个虚引用在引用它，则该对象是 虚可到达 对象。

source: An object is softly reachable if it is not strongly reachable but can be reached by traversing a soft reference.
zh_cn: 如果一个对象不是强可到达对象，但通过遍历某一软引用可以到达它，则该对象是 软可到达 对象。

source: An object is strongly reachable if it can be reached by some thread without traversing any reference objects.
zh_cn: 如果某一线程可以不必遍历所有引用对象而直接到达一个对象，则该对象是 强可到达 对象。

source: An object is weakly reachable if it is neither strongly nor softly reachable but can be reached by traversing a weak reference.
zh_cn: 如果一个对象既不是强可到达对象，也不是软可到达对象，但通过遍历弱引用可以到达它，则该对象是 弱可到达 对象。

source: An object of type Boolean contains a single field whose type is boolean.
zh_cn: 一个 Boolean 类型的对象只包含一个类型为 boolean 的字段。

source: An object of type Byte contains a single field whose type is byte.
zh_cn: 一个 Byte 类型的对象只包含一个类型为 byte 的字段。

source: An object of type Character contains a single field whose type is char.
zh_cn: Character 类型的对象包含类型为 char 的单个字段。

source: An object of type Double contains a single field whose type is double.
zh_cn: 每个 Double 类型的对象都包含一个 double 类型的字段。

source: An object of type Float contains a single field whose type is float.
zh_cn: Float 类型的对象包含一个 float 类型的字段。

source: An object of type Integer contains a single field whose type is int.
zh_cn: Integer 类型的对象包含一个 int 类型的字段。

source: An object of type Long contains a single field whose type is long.
zh_cn: 每个 Long 类型的对象都包含一个 long 类型的字段。

source: An object of type Short contains a single field whose type is short.
zh_cn: 一个 Short 类型的对象只包含一个 short 类型的字段。

source: An object of type Double, for example, contains a field whose type is double, representing that value in such a way that a reference to it can be stored in a variable of reference type.
zh_cn: 例如，一个 Double 类型的对象包含了一个类型为 double 的字段，这表示如果引用某个值，则可以将该值存储在引用类型的变量中。

source: An object reference that may be updated atomically.
zh_cn: 可以用原子方式更新的对象引用。

source: An object that creates new threads on demand.
zh_cn: 根据需要创建新线程的对象。

source: An object that executes submitted Runnable tasks.
zh_cn: 执行已提交的 Runnable 任务的对象。

source: An object that implements the Enumeration interface generates a series of elements, one at a time.
zh_cn: 实现 Enumeration 接口的对象，它生成一系列元素，一次生成一个。

source: An object that is reachable via phantom references will remain so until all such references are cleared or themselves become unreachable.
zh_cn: 通过虚引用可到达的对象将仍然保持原状，直到所有这类引用都被清除，或者它们都变得不可到达。

source: An object that maps keys to values.
zh_cn: 将键映射到值的对象。

source: An object to which char sequences and values can be appended.
zh_cn: 能够被添加 char 序列和值的对象。

source: An optionally-bounded blocking deque based on linked nodes.
zh_cn: 一个基于已链接节点的、任选范围的阻塞双端队列。

source: An optionally-bounded blocking queue based on linked nodes.
zh_cn: 一个基于已链接节点的、范围任意的 blocking queue。

source: An ordered collection (also known as a sequence).
zh_cn: 有序的 collection（也称为 序列 ）。

source: An unbounded blocking queue of Delayed elements, in which an element can only be taken when its delay has expired.
zh_cn: Delayed 元素的一个无界阻塞队列，只有在延迟期满时才能从中提取元素。

source: An unbounded blocking queue that uses the same ordering rules as class PriorityQueue and supplies blocking retrieval operations.
zh_cn: 一个无界阻塞队列，它使用与类 PriorityQueue 相同的顺序规则，并且提供了阻塞获取操作。

source: An unbounded TransferQueue based on linked nodes.
zh_cn: 一个基于链接节点的无界 TransferQueue。

source: An unbounded concurrent deque based on linked nodes.
zh_cn: 一个基于链接节点的无界并发deque。

source: An unbounded priority queue based on a priority heap.
zh_cn: 一个基于优先级堆的无界优先级 队列。

source: An unbounded thread-safe queue based on linked nodes.
zh_cn: 一个基于链接节点的无界线程安全queue。

source: An unlock (synchronized block or method exit) of a monitor happens-before every subsequent lock (synchronized block or method entry) of that same monitor.
zh_cn: 一个解除锁监视器的（synchronized 阻塞或方法退出）happen-before 相同监视器的每个后续锁（synchronized 阻塞或方法进入）。

source: And because the happens-before relation is transitive, all actions of a thread prior to unlocking happen-before all actions subsequent to any thread locking that monitor.
zh_cn: 并且因为 happen-before 关系是可传递的，所以解除锁定之前的线程的所有操作 happen-before 锁定该监视器的任何线程后续的所有操作。

source: And unsynchronized collections are preferable when either collections are unshared, or are accessible only when holding other locks.
zh_cn: 当 collection 是未共享的，或者仅保持其他锁时 collection 是可访问的情况下，非同步 collection 则要更好一些。

source: And when they become too small (due to removal or resizing) they are converted back to plain bins.
zh_cn: 当它们变得太小时（由于移除或调整大小），它们被转换回普通 bins。

source: Android-changed: Detect changes to modCount early.
zh_cn: Android 的更改：及早检测 modcount 的更改。

source: Annotation retention policy.
zh_cn: 注释保留策略。

source: Annotation type declaration
zh_cn: 注释类型声明

source: Annotations
zh_cn: 注解

source: Annotations are to be discarded by the compiler.
zh_cn: 编译器要丢弃的注释。

source: Annotations are to be recorded in the class file by the compiler and retained by the VM at run time, so they may be read reflectively.
zh_cn: 编译器将把注释记录在类文件中，在运行时 VM 将保留注释，因此可以反射性地读取。

source: Annotations are to be recorded in the class file by the compiler but need not be retained by the VM at run time.
zh_cn: 编译器将把注释记录在类文件中，但在运行时 VM 不需要保留注释。

source: Another thread notifies threads waiting on this object's monitor to wake up either through a call to the notify method or the notifyAll method.
zh_cn: 其他线程通过调用 notify 方法，或 notifyAll 方法通知在此对象的监视器上等待的线程醒来。

source: Any BlockingQueue may be used to transfer and hold submitted tasks.
zh_cn: 所有 BlockingQueue 都可用于传输和保持提交的任务。

source: Any char which maps to a surrogate code point is passed through uninterpreted.
zh_cn: 任何映射到 surrogate code point 的字符都会不加解释地传递。

source: Any class name provided as a String parameter to methods in ClassLoader must be a binary name as defined by The Java™ Language Specification.
zh_cn: 按照 The Java™ Language Specification 的定义，任何作为 String 类型参数传递给 ClassLoader 中方法的类名称都必须是一个二进制名称。

source: Any exception thrown by the finalize method causes the finalization of this object to be halted, but is otherwise ignored.
zh_cn: finalize 方法抛出的任何异常都会导致此对象的终结操作停止，但可以通过其他方法忽略它。

source: Any exception thrown by this method will be ignored by the Java Virtual Machine.
zh_cn: Java 虚拟机将忽略该方法抛出的任何异常。

source: Any monitors it held would have remained locked.
zh_cn: 它所保持的任何监视器都会保持锁定状态。

source: Any other code units, including ordinary BMP characters, unpaired surrogates, and undefined code units, are zero-extended to int values which are then passed to the stream.
zh_cn: 任何其他代码单元，包括普通 BMP 字符、未配对的代理项和未定义的代码单元，都是 zero-extended int 值，然后传递给流。

source: Any surrogate pairs encountered in the sequence are combined as if by Character.toCodePoint and the result is passed to the stream.
zh_cn: 序列中遇到的任何代理项对都被组合起来，就好像通过 Character.toCodePoint 一样，结果被传递给流。

source: Appendables are not necessarily safe for multithreaded access.
zh_cn: Appendable 对于多线程访问而言没必要是安全的。

source: Appends a subsequence of the specified CharSequence to this sequence.
zh_cn: 将指定 CharSequence 的子序列追加到此序列。

source: Appends a subsequence of the specified character sequence to this Appendable.
zh_cn: 向此 Appendable 添加指定字符序列的子序列。

source: Appends the specified CharSequence to this sequence.
zh_cn: 将指定的 CharSequence 追加到该序列。

source: Appends the specified StringBuffer to this sequence.
zh_cn: 将指定的 StringBuffer 追加到此序列。

source: Appends the specified character sequence to this Appendable.
zh_cn: 向此 Appendable 追加指定的字符序列。

source: Appends the specified character to this Appendable.
zh_cn: 向此 Appendable 添加指定字符。

source: Appends the specified exception to the exceptions that were suppressed in order to deliver this exception.
zh_cn: 将指定的异常附加到为传递此异常而抑制的异常。

source: Appends the specified string to this character sequence.
zh_cn: 将指定的字符串追加到此字符序列。

source: Appends the string representation of a subarray of the char array argument to this sequence.
zh_cn: 将数组参数 char 子数组的字符串表示形式追加到此序列。

source: Appends the string representation of the Object argument.
zh_cn: 追加 Object 参数的字符串表示形式。

source: Appends the string representation of the boolean argument to the sequence.
zh_cn: 将 boolean 参数的字符串表示形式追加到序列。

source: Appends the string representation of the char argument to this sequence.
zh_cn: 将 char 参数的字符串表示形式追加到此序列。

source: Appends the string representation of the char array argument to this sequence.
zh_cn: 将 char 数组参数的字符串表示形式追加到此序列。

source: Appends the string representation of the codePoint argument to this sequence.
zh_cn: 将 codePoint 参数的字符串表示形式追加到此序列。

source: Appends the string representation of the double argument to this sequence.
zh_cn: 将 double 参数的字符串表示形式追加到此序列。

source: Appends the string representation of the float argument to this sequence.
zh_cn: 将 float 参数的字符串表示形式追加到此序列。

source: Appends the string representation of the int argument to this sequence.
zh_cn: 将 int 参数的字符串表示形式追加到此序列。

source: Appends the string representation of the long argument to this sequence.
zh_cn: 将 long 参数的字符串表示形式追加到此序列。

source: Applications implement subclasses of ClassLoader in order to extend the manner in which the Java virtual machine dynamically loads classes.
zh_cn: 应用程序需要实现 ClassLoader 的子类，以扩展 Java 虚拟机动态加载类的方式。

source: Applications should throw instances of this class to indicate other illegal uses of the null object.
zh_cn: 应用程序应该抛出该类的实例，指示其他对 null 对象的非法使用。

source: Arguments of primitive types are wrapped in instances of the appropriate primitive wrapper class, such as java.lang.Integer or java.lang.Boolean.
zh_cn: 基本类型的参数被包装在适当基本包装器类（如 java.lang.Integer 或 java.lang.Boolean）的实例中。

source: As a consequence, users of type variables must not rely on the identity of instances of classes implementing this interface.
zh_cn: 因此，使用类型变量的用户决不能依靠实现此接口的类实例的身份。

source: As a general rule, the default load factor (.75) offers a good tradeoff between time and space costs.
zh_cn: 通常，默认加载因子 (.75) 在时间和空间成本上寻求一种折衷。

source: As a result, the subprocess may inherit additional environment variable settings beyond those in the process builder's environment().
zh_cn: 其结果是，子进程可以继承超出那些在进程生成器的 environment() 附加环境变量设置。

source: As in the one argument version, interrupts and spurious wakeups are possible, and this method should always be used in a loop:
zh_cn: 对于某一个参数的版本，实现中断和虚假唤醒是有可能的，并且此方法应始终在循环中使用：

source: As long as the length of the character sequence contained in the string buffer does not exceed the capacity, it is not necessary to allocate a new internal buffer array.
zh_cn: 只要字符串缓冲区所包含的字符序列的长度没有超出此容量，就无需分配新的内部缓冲区数组。

source: As long as the length of the character sequence contained in the string builder does not exceed the capacity, it is not necessary to allocate a new internal buffer.
zh_cn: 只要字符串生成器所包含的字符序列的长度没有超出此容量，就无需分配新的内部缓冲区。

source: As mentioned, URL and URLConnection rely on protocol handlers which must be present, otherwise an Exception is thrown.
zh_cn: 如上所述，URL 和 URLConnection 都依赖于协议处理程序，所以协议处理程序必须存在；否则将抛出异常。

source: As much as is reasonably practical, the hashCode method defined by class Object does return distinct integers for distinct objects.
zh_cn: 实际上，由 Object 类定义的 hashCode 方法确实会针对不同的对象返回不同的整数。

source: As of 1.5, start() is the preferred way to create a Process.
zh_cn: 作为 1.5，start() 是创建一个 Process 的首选方式。

source: As of JDK 1.1, the preferred way to create a stream from a string is via the StringReader class.
zh_cn: 从 JDK 1.1 开始，从字符串创建流的首选方法是通过 StringReader 类进行创建。

source: As of JDK 1.1, the preferred way to do this is via the getBytes() method, which uses the platform's default charset.
zh_cn: 从 JDK 1.1 起，完成该转换的首选方法是通过 getBytes() 方法，该方法使用平台的默认字符集。

source: As of JDK 1.1, the preferred way to do this is via the String constructors that take a Charset, charset name, or that use the platform's default charset.
zh_cn: 从 JDK 1.1 开始，完成该转换的首选方法是使用带有 Charset、字符集名称，或使用平台默认字符集的 String 构造方法。

source: As of JDK 1.1, the preferred way to operate on character streams is via the new character-stream classes, which include a class for counting line numbers.
zh_cn: 从 JDK 1.1 开始，对字符流操作的首选方法是通过新字符流类（其中包括计算行号的类）进行操作。

source: As of release 1.4, this exception has been retrofitted to conform to the general purpose exception-chaining mechanism.
zh_cn: 从版本 1.4 开始，此异常已经更新，符合常用的异常链机制。

source: As of release JDK 5, this class has been supplemented with an equivalent class designed for use by a single thread, StringBuilder.
zh_cn: 从 JDK 5 开始，为该类补充了一个单个线程使用的等价类，即 StringBuilder。

source: As the name indicates, this is just an Identifier and doesn't provide directly the means to access the resource.
zh_cn: 顾名思义，它只是一个标识符，不直接提供访问资源的方法。

source: Aside from the clearing operation reference objects are otherwise immutable, so no set operation is provided.
zh_cn: 引用对象是不可变的，因此，除了清除操作之外，没有提供 set 操作。

source: Associates the specified value with the specified key in this map (optional operation).
zh_cn: 在此映射中关联指定值与指定键(可选操作)。

source: Associates the specified value with the specified key in this map.
zh_cn: 在此映射中关联指定值与指定键。

source: At any point in time it contains some particular sequence of characters, but the length and content of the sequence can be changed through certain method calls.
zh_cn: 虽然在任意时间点上它都包含某种特定的字符序列，但通过某些方法调用可以改变该序列的长度和内容。

source: At that time it may choose to clear atomically all soft references to that object and all soft references to any other softly-reachable objects from which that object is reachable through a chain of strong references.
zh_cn: 这时，它可以选择自动清除针对该对象的所有软引用，以及通过强引用链，从其可以到达该对象的针对任何其他软可到达对象的所有软引用。

source: At that time it will atomically clear all weak references to that object and all weak references to any other weakly-reachable objects from which that object is reachable through a chain of strong and soft references.
zh_cn: 这时，它将自动清除针对此对象的所有弱引用，以及通过强引用链和软引用，可以从其到达该对象的针对任何其他弱可到达对象的所有弱引用。

source: At the same time it will declare all of the formerly weakly-reachable objects to be finalizable.
zh_cn: 同时它将声明所有以前的弱可到达对象为可终结的。

source: At the same time or at some later time it will enqueue those newly-cleared soft references that are registered with reference queues.
zh_cn: 在同一时间或晚些时候，它会将那些已经向引用队列注册的新清除的软引用加入队列。

source: At the same time or at some later time it will enqueue those newly-cleared weak references that are registered with reference queues.
zh_cn: 在同一时间或晚些时候，它将那些已经向引用队列注册的新清除的弱引用加入队列。

source: At this point, the reference is considered to be enqueued.
zh_cn: 此时，该引用被认为是 已加入队列的。

source: Atomic classes are designed primarily as building blocks for implementing non-blocking data structures and related infrastructure classes.
zh_cn: 设计原子类主要用作各种构造块，用于实现非阻塞数据结构和相关的基础结构类。

source: Atomic classes are not general purpose replacements for java.lang.Integer and related classes.
zh_cn: 原子类不是 java.lang.Integer 和相关类的通用替换方法。

source: Attempting to insert or query the presence of a null key or value will throw a NullPointerException.
zh_cn: 试图插入空键或空值或者试图查询它们的存在，都将抛出 NullPointerException。

source: Attempting to query the presence of a key or value which is not of type String will throw a ClassCastException.
zh_cn: 如果试图查询不是 String 类型的键或值的存在，则会抛出 ClassCastException。

source: Attempts to compute a mapping for the specified key and its current mapped value (or null if there is no current mapping).
zh_cn: 尝试计算用于指定键和其当前映射值(或 null 如果没有当前映射)的映射。

source: Attempts to read characters into the specified character buffer.
zh_cn: 试图将字符读入指定的字符缓冲区。

source: Attempts to reduce storage used for the character sequence.
zh_cn: 尝试减少用于字符序列的存储空间。

source: Attempts to set all system properties.
zh_cn: 尝试设置所有系统属性。

source: Attempts to stop all actively executing tasks, halts the processing of waiting tasks, and returns a list of the tasks that were awaiting execution.
zh_cn: 尝试停止所有的活动执行任务、暂停等待任务的处理，并返回等待执行的任务列表。

source: Automatically generated names are of the form "Thread-"+n, where n is an integer.
zh_cn: 自动生成的名称的形式为 "Thread-"+n，其中的 n 为整数。

source: Automatically-cleared references
zh_cn: 自动清除引用

source: Avoid Soft References for Caching
zh_cn: 避免缓存软引用

source: Base class for character conversion exceptions.
zh_cn: 用于字符转换异常的基类。

source: Basic hash bin node, used for most entries.
zh_cn: 基本的哈希 bin 节点，用于大多数 entry。

source: Basic thread blocking primitives for creating locks and other synchronization classes.
zh_cn: 用来创建锁和其他同步类的基本线程阻塞原语。

source: Because String objects are immutable they can be shared.
zh_cn: 因为 String 对象是不可变的，所以可以共享。

source: Because TreeNodes are about twice the size of regular nodes, we use them only when bins contain enough nodes to warrant use (see TREEIFY_THRESHOLD).
zh_cn: 由于 TreeNodes 大约是常规节点大小的两倍，因此我们仅在 bins 包含足够的节点以保证使用时才使用它们（请参阅 TREEIFY_THRESHOLD ）。

source: Because many common sets of hashes are already reasonably distributed (so don't benefit from spreading), and because we use trees to handle large sets of collisions in bins, we just XOR some shifted bits in the cheapest possible way to reduce systematic lossage, as well as to incorporate impact of the highest bits that would otherwise never be used in index calculations because of table bounds.
zh_cn: 因为许多常见的散列集合已经合理分布（所以不能从扩散中受益），并且因为我们使用树来处理 bins 中的大量碰撞。我们只以最便宜的方式对一些位移进行异或运算，以减少系统损失， 以及合并最高位的影响，这些最高位由于表边界而不会用于索引计算。
